# Concat two dataframe using concat() function

In [2]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_Weather = pd.DataFrame({
    "city":["chicago","new york","washington"],
    "temperature":[15,18,22],
    "humidity":[50,60,70]
})
us_Weather

         city  temperature  humidity
0     chicago           15        50
1    new york           18        60
2  washington           22        70

In [4]:
#Concat two dataframe using concat() function
df =pd.concat([india_weather,us_Weather])
df

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2    banglore           30        78
0     chicago           15        50
1    new york           18        60
2  washington           22        70

In [7]:
#ignore_index argument in concat() function 

df=pd.concat([india_weather,us_Weather], ignore_index=True )
df

         city  temperature  humidity
0      mumbai           32        80
1       delhi           45        60
2    banglore           30        78
3     chicago           15        50
4    new york           18        60
5  washington           22        70

In [5]:
#What is "keys"? pass "keys" to concat() function
# creting sub set
df=pd.concat([india_weather,us_Weather], keys=["india",'Usa'])
df

               city  temperature  humidity
india 0      mumbai           32        80
      1       delhi           45        60
      2    banglore           30        78
Usa   0     chicago           15        50
      1    new york           18        60
      2  washington           22        70

In [7]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [9]:
df.iloc[0]

city           mumbai
temperature        32
humidity           80
Name: (india, 0), dtype: object

In [25]:
#"axis" argument in concat() function
#appdend dataframe in column

temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [29]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "windspeed": [7,12,3],
})
windspeed_df

       city  windspeed
0     delhi          7
1    mumbai         12
2  banglore          3

In [30]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature      city  windspeed
0    mumbai           32     delhi          7
1     delhi           45    mumbai         12
2  banglore           30  banglore          3

In [31]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [32]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [33]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [35]:
#join dataframe with series() function 

s=pd.Series(["humid",'dry','rain'], name='event')
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [37]:
s=pd.concat([df,s],axis=1)
s

       city  temperature    city  windspeed  event
0    mumbai           32  mumbai       12.0  humid
1     delhi           45   delhi        7.0    dry
2  banglore           30     NaN        NaN   rain